[
  {
    "id": 1,
    "name": "Geometric Sculpture",
    "image": "https://images.pexels.com/photos/6147369/pexels-photo-6147369.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "A stunning geometric sculpture with intricate patterns that catch the light beautifully. Each piece is carefully printed with premium materials for durability and visual impact.",
    "detailedDescription": "This geometric sculpture represents the perfect blend of mathematics and art. The complex patterns are generated using parametric algorithms, making each piece uniquely mesmerizing. The sculpture stands 12 inches tall and is printed using our premium PLA filament with a metallic finish that catches and reflects light in stunning ways. Perfect as a centerpiece or statement art for modern interiors.",
    "category": "Abstract",
    "price": 129.99,
    "customizable": true,
    "dimensions": "12\" x 8\" x 8\"",
    "material": "Premium PLA",
    "weight": "1.2 lbs"
  },
  {
    "id": 2,
    "name": "Dragon Figurine Collection",
    "image": "https://images.pexels.com/photos/8828687/pexels-photo-8828687.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "Highly detailed fantasy dragon figurines with intricate scales and poses. Perfect for collectors, gamers, and fantasy enthusiasts.",
    "detailedDescription": "Our Dragon Figurine Collection features meticulously crafted fantasy dragons in various poses and styles. Each figurine is printed with ultra-high resolution to capture every scale, wing membrane, and facial detail. Available in multiple sizes and can be printed in various colors including metallic finishes. These pieces are perfect for tabletop gaming, display collections, or as gifts for fantasy lovers. Each dragon comes with a custom base and optional LED lighting kit for dramatic effect.",
    "category": "Figurines",
    "price": 89.99,
    "customizable": true,
    "dimensions": "8\" x 6\" x 10\"",
    "material": "High-detail resin",
    "weight": "0.8 lbs"
  },
  {
    "id": 3,
    "name": "Portrait Relief Art",
    "image": "https://images.pexels.com/photos/3004909/pexels-photo-3004909.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "Custom 2D relief portraits created from your photos. Transform cherished memories into stunning dimensional art pieces.",
    "detailedDescription": "Our Portrait Relief Art service transforms your favorite photographs into beautiful 2D relief sculptures. Using advanced image processing and 3D modeling techniques, we convert flat photos into dimensional art that captures depth, emotion, and detail. Perfect for memorial pieces, family portraits, or pet remembrances. Each piece is carefully hand-finished and can be mounted in elegant frames or displayed as standalone art. Available in various sizes and finishes including bronze, silver, and natural white.",
    "category": "2D Art",
    "price": 199.99,
    "customizable": true,
    "dimensions": "12\" x 16\" x 1\"",
    "material": "Premium PLA with finishing",
    "weight": "1.5 lbs"
  },
  {
    "id": 4,
    "name": "Anime Character Figurines",
    "image": "https://images.pexels.com/photos/7862463/pexels-photo-7862463.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "Popular anime and manga character figurines with authentic details and dynamic poses. Licensed and original designs available.",
    "detailedDescription": "Bring your favorite anime characters to life with our detailed figurine collection. Each piece is carefully modeled to capture the unique style and personality of beloved characters from popular series. Features include authentic costumes, dynamic action poses, and character-specific accessories. All figurines are printed with high-resolution detail and hand-painted finishes available. Perfect for collectors, cosplayers, and anime enthusiasts. Custom character commissions also available.",
    "category": "Figurines",
    "price": 79.99,
    "customizable": true,
    "dimensions": "7\" x 4\" x 9\"",
    "material": "High-detail resin",
    "weight": "0.6 lbs"
  },
  {
    "id": 5,
    "name": "Lithophane Art Panels",
    "image": "https://images.pexels.com/photos/1906439/pexels-photo-1906439.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "Beautiful lithophane panels that reveal stunning images when backlit. Transform any photo into magical illuminated art.",
    "detailedDescription": "Lithophanes are a unique form of 2D art that creates stunning visual effects through varying thickness of material. When backlit, these panels reveal beautiful grayscale images with incredible detail and depth. Perfect for landscape photography, portraits, or artistic images. Each lithophane is custom-created from your provided image and includes a LED backlight frame for optimal display. The varying thickness creates different levels of light transmission, resulting in a magical glowing effect that brings photos to life.",
    "category": "2D Art",
    "price": 149.99,
    "customizable": true,
    "dimensions": "10\" x 8\" x 0.5\"",
    "material": "Translucent PLA",
    "weight": "0.8 lbs"
  },
  {
    "id": 6,
    "name": "Superhero Action Figures",
    "image": "https://images.pexels.com/photos/163036/mario-luigi-yoschi-figures-163036.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "Custom superhero action figures with articulated joints and interchangeable accessories. Create your own hero or choose from classics.",
    "detailedDescription": "Our Superhero Action Figures combine the nostalgia of classic action figures with modern 3D printing precision. Each figure features multiple points of articulation, allowing for dynamic posing and play. Includes interchangeable hands, weapons, and accessories. Available as popular superhero designs or completely custom characters based on your specifications. Perfect for collectors, kids, or anyone who wants to bring their superhero dreams to life. Each figure is printed in durable materials and hand-assembled for quality.",
    "category": "Figurines",
    "price": 119.99,
    "customizable": true,
    "dimensions": "6\" x 3\" x 8\"",
    "material": "Durable ABS plastic",
    "weight": "0.7 lbs"
  },
  {
    "id": 7,
    "name": "Mandala Relief Wall Art",
    "image": "https://images.pexels.com/photos/6044198/pexels-photo-6044198.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "Intricate mandala designs in raised relief format. Sacred geometry meets modern 3D printing for stunning wall displays.",
    "detailedDescription": "Our Mandala Relief Wall Art pieces bring ancient sacred geometry into the modern world through precision 3D printing. Each mandala features intricate patterns and symbols that create beautiful shadow play throughout the day as light moves across the surface. Available in various sizes and can be arranged in groups for larger installations. The raised relief format adds depth and dimension that traditional 2D mandalas cannot achieve. Perfect for meditation spaces, yoga studios, or anyone who appreciates the beauty of geometric art.",
    "category": "2D Art",
    "price": 89.99,
    "customizable": true,
    "dimensions": "16\" x 16\" x 1\"",
    "material": "Premium PLA",
    "weight": "1.2 lbs"
  },
  {
    "id": 8,
    "name": "Architectural Cityscape",
    "image": "https://images.pexels.com/photos/1619317/pexels-photo-1619317.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "description": "A detailed miniature cityscape featuring iconic buildings from around the world. Perfect for architecture enthusiasts and collectors.",
    "detailedDescription": "Our Architectural Cityscape is a celebration of human engineering and design. This intricate piece features meticulously detailed replicas of iconic buildings from major cities worldwide, all arranged in a harmonious composition. Each building is printed with extreme precision to capture the architectural details that make these structures famous. The entire cityscape measures 18 inches wide and is mounted on a solid base with a protective clear dome available as an optional add-on.",
    "category": "Architecture",
    "price": 249.99,
    "customizable": true,
    "dimensions": "18\" x 12\" x 6\"",
    "material": "High-detail resin",
    "weight": "2.5 lbs"
  }
]
